nxp-mcuxpresso/mcux-sdk-examples/frdmke16z/driver_examples/mscan/loopback/pin_mux.h
/*
 * Copyright 2018 ,2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTB1 (number 26), UART0_TX_TGTMCU
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_DEBUG_UART_TX_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_DEBUG_UART_TX_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_TX_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTB0 (number 27), UART0_RX_TGTMCU
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_DEBUG_UART_RX_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_DEBUG_UART_RX_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_RX_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTC6 (number 40), U11[4]/CAN_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_CAN_RX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_CAN_RX_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_CAN_RX_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTC7 (number 39), U11[1]/CAN_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_CAN_TX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_CAN_TX_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_CAN_TX_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
